// Бібліотека та компоненти
#include <iostream>

using namespace std;

//головна функція
int main ()

{
//================== Begin 11 ==================
   
//Декларація змінних 
double S, L, R;

// Константа
const double pi = 3.14;

//communication
cout << "================== Begin 11 ==================" << endl;

// Введення змінних
cout << "Значення L=";
cin >> L;

// розрахунок результату
   R = L / (2 * pi);
   
// вивід результату
 cout << "R = " << R << endl;
 
// розрахунок результату 
 S = pi * R * R;
 
 // вивід результату
 cout << "S = " << S << endl << endl;

   // ================== Begin 16 ==================
// декларація змінних та їх значень
double y, x;

//communication
cout << "================== Begin 16 ==================" << endl;

// введення змінної
cout <<"Значення x = ";
cin >> x;

// розрахунок результату
y = 3 * x * x * x * x * x * x - 6 * x * x - 7;

// вивід результату
 cout << "y = " << y << endl << endl;
// задача ...

   //================== Begin 45 ==================    
// декларація змінних
double S1, V, t;

//communication
cout << "================== Begin 45 ==================" << endl;

// введення змінних
cout << "Значення S1 = ";
cin >> S1;
cout << "Значення t = ";
cin >> t;

// розрахунок результату
V = S1 / t;

// вивід результату
cout << "V = " << V << endl;
 
return 0;
}

