#include <iostream>
#include <cmath>// підключення бібліотеки математичних функцій
using namespace std;
int main()
{
    
   // Integer35. Дано кількість годин.
   // Використовуючи операцію ділення,
   // Визначити кількість діб і залишок годин
   // (1 доба = 24 год).
   cout << "============== Integer35. ==============" << endl;
   
   double t, D; // декларація цілих змінних
   
   // введення даних
   cout << endl << "Введіть t (год) = "; 
   cin >> t;
   
   // підрахунок
   D = t / 24;
   
   // виведення результату
   cout << "Результат: D (діб) = " << D << endl << endl;

	// Boolean37.Дано координати двох різних полів шахової дошки.
	// Перевірити істинність висловлювання: «Король за один хід може перейти з одного поля на інше».
	cout << "============== Boolean37. ==============" << endl;
	
	//Декларація змінних 
	int x1, y1, x2, y2;
	
	// введення даних (числа від 1 до 8 включно)
	cout << " Введіть x1 (1-8) = "; cin >> x1;
	cout << " Введіть x2 (1-8) = "; cin >> y1;
	cout << " Введіть y1 (1-8) = "; cin >> x2;
	cout << " Введіть y2 (1-8) = "; cin >> y2;
	
	// підрахунок. Король може зробити хід, якщо різниця між координатами по X та Y не перевищує 1
	bool result = (abs(x1 - x2) <= 1) && (abs(y1 - y2) <= 1); // визначення ЛОГІЧНОЇ змінної
	
	// виведення результату
	cout << "Результат: " << boolalpha << result << endl << endl;
  
    // y = ... (табл.3 №22)
   cout << "============== Math.22. ==============" << endl;
   
   const double pi = 3.141592; // визначення дійсної константи
   
   double x, num, denom, y; // декларація дійсних змінних
   // введення даних
   
   cout << "Значення x = ";
   cin >> x;
   
   // підрахунок
   num = log(fabs(x)) * sqrt(fabs(x * x * pow(sin((x) * pi / 180), 3) * sqrt(cos((x) * pi / 180)))); // чисельник
   denom = (cos((x) * pi / 180)) + 0.2 * sqrt(2 * x + sqrt(5 * x)); // знаменник
   y = 0.25 * (num / denom);
   
   // виведення результату
   cout << "Результат: y = " << y << endl;
   
return 0;
}
