#include <iostream>
#include <cmath>// підключення бібліотеки математичних функцій
using namespace std;

//If10.Дано дві змінні цілого типу: A і B. Якщо їх значення не рівні, то присвоїти кожній
//змінній суму цих значень, а якщо рівні, то присвоїти змінним нульові значення.
//Вивести нові значення змінних A і B.
void task_if10(); // завдання 1 декларація функці

// Дано координати точки на площині (x, y).
// Визначити, чи потрапляє точка в фігуру заданого кольору (або групу фігур)
// і вивести відповідне повідомлення.
void Figure3();// завдання 2 декларація функції

   int main() {
   int menu;
   cout << "Номер завдання:";
   cin >> menu;
   // перемикання між завданнями
   switch (menu)
   {
    case 1: task_if10(); break; // Завдання 1
    case 2: Figure3(); break; // Завдання 2
    default: cout << "Неправильне завдання! (Тільки 1,2)" << endl; //повідомлення про помилку
   }
    system ("Зачекайте");
    return 0;
}
// завдання 1 реалізація
void task_if10()
{
   cout << "=================== If 10 ===================" << endl;
   
   int A, B, sum;// Декларація змінних
   cout << "Введіть значення A, В: "; cin >> A >> B;
   
   if (A != B) { // умова, якщо значення не рівні
    int (sum = A + B);  
      A = sum; 
      B = sum;
    } else { // інакше, якщо числа рівні
        A = 0;
        B = 0;
    } 

cout << "Нове значення А:" << A << endl;
cout << "Нове значення B:" << B << endl;
}

// завдання 2 реалізація
void Figure3 () {
    
    cout << "=================== Figure3 ===================" << endl;
    
   // Декларація змінних
   double a, r; // сторона трикутника та радіус
   double x, y; // координати точки
   
   cout << "Введіть a, r: ";
   cin >> a >> r;
   
   if (cin.fail() || a <= 0) // Перевірка значення
    {
   cerr << "Некоректні дані!" << endl;
return;
}

cout << "Введіть координати точки (x, y): ";
cin >> x >> y;
   if (!cin) // Перевірка значення
   {
   cout << "Не числові дані!" << endl;
return;
}
// Оскільки a = 2*r, радіус кола r = a / 2.0
    r = a / 2.0;
    double R2 = r * r; // квадрат радіуса

    // Центр кола знаходиться у точці (r, 0)
    double xc = r, yc = 0.0;
    double circle = pow(x - xc, 2) + pow(y - yc, 2); // квадрат відстані до центра

    // Умови для жовтої області 
    bool inTriangle = x >= 0 && y >= 0 && (x + y <= a); // точка всередині трикутника
    bool outsideCircle = circle > R2;                   // точка поза колом

    if (inTriangle && outsideCircle) {
        cout << "Точка належить області Варіанту 3" << endl;
    } else {
        cout << "Точка НЕ належить області Варіанту 3" << endl;
    }

    return;
}
