// Бібліотека та компоненти
#include <iostream>
using namespace std;

// головна функція
int main()
{
// =================== Завдання Begin 45 =================== 
// декларація змінних
double S, V, t;

//communication
cout << "==== Завдання Begin 45 ==== \n";
  
// введення змінних
cout << "Значення S = ";
cin >> S;
cout << "Значення t = ";
cin >> t;

cout << "Записано значення S:" << S << endl;
cout << "Записано значення t:" << t << endl;
  
// розрахунок результату
V = S / t;

// вивід результату
cout << "Розрахована швидкість V = " << V << endl;
  
/*  
// перевірка правильності введених даних
if (S >= 0 && t > 0)
  
{ // розрахунок результату
V = S / t;
// вивід результату
cout << "V = " << V << endl;
}
else
// Якщо данні з помилкою, то
{
cout << "Помилка! S >= 0, а t > 0." << endl;
}
*/
  
return 0;
}
